# 연습 문제 4.1.2

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [1]:
import pandas as pd

In [2]:
data = {
    "정수1": [1, 2, 3, 4, 5],
    "문자열": ["삼각지", "숙대입구","서울역", "회현","명동"],
    "실수1": [1.1, 2.1, 3.1, 4.1, 5.1],
    "정수2": [6, 7, 8, 9,10],
    "실수2": [6.1, 7.1, 8.1, 9.1,10.1]
}
columns = ["정수1", "문자열", "실수1", "정수2", "실수2"]
index = ["김씨", "부씨", "인씨", "구씨","이씨"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    정수1   문자열  실수1  정수2   실수2
김씨    1   삼각지  1.1    6   6.1
부씨    2  숙대입구  2.1    7   7.1
인씨    3   서울역  3.1    8   8.1
구씨    4    회현  4.1    9   9.1
이씨    5    명동  5.1   10  10.1

# 연습 문제 4.1.3

다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

(5) 춘향의 점수를 데이터프레임으로 나타낸다.

(6) 향단의 점수를 시리즈로 나타낸다.

In [3]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [4]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [5]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [23]:
import numpy as np

In [7]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
# step 1) 학생의 각 과목 평균
df.mean(axis = 1).round(2)

# step 2) 구한 평균을 새로운 열로 추가하기
df["평균"] = df.mean(axis = 1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [8]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
# 개별 데이터 인덱싱은 [][]
df["영어"]["방자"] = 80
df

<ipython-input-8-3d141c02b7f8>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  46.67

In [9]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df[:'춘향']

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [10]:
# (6) 향단의 점수를 시리즈로 나타낸다.
# .T 속성은 데이터프레임에서 index와 column을 바꾼 형태의 데이타프레임
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

# 연습 문제 4.4.1

타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

In [2]:
# 타이타닉호의 승객 데이터를 데이터프레임으로 읽어오기
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

#연습 문제 4.4.2

sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [12]:
titanic['sex'].value_counts().sort_values()

female    314
male      577
Name: sex, dtype: int64

In [13]:
titanic['age'].value_counts().sort_values()

12.00     1
24.50     1
66.00     1
20.50     1
0.67      1
         ..
19.00    25
28.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [14]:
titanic['class'].value_counts().sort_values()

Second    184
First     216
Third     491
Name: class, dtype: int64

In [15]:
titanic.alive.value_counts().sort_values()

yes    342
no     549
Name: alive, dtype: int64

# 연습 문제 4.4.3

타이타닉호 승객의 평균 나이를 구하라.

타이타닉호 승객중 여성 승객의 평균 나이를 구하라.

타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [8]:
titanic.age.mean()

29.69911764705882

In [9]:
female = titanic[titanic['sex']=='female']
female.age.mean()

# titanic[titanic.sex == 'female'].age.mean()

27.915708812260537

In [10]:
df1 = titanic[titanic.pclass == 1]
dft[]

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: pclass, Length: 891, dtype: int64

# 연습 문제 4.4.4

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.

20살이 넘으면 성별을 그대로 사용한다.

20살 미만이면 성별에 관계없이 “child”라고 한다.

In [16]:
titanic = titanic[['survived','pclass','sex','age']]

In [18]:
# 경고창 제거
import warnings
warnings.filterwarnings('ignore')

In [19]:
titanic['category1']=titanic.apply(
    lambda r: r.sex if r.age >= 20 else 'child', axis=1
)
titanic.tail()

     survived  pclass     sex   age category1
886         0       2    male  27.0      male
887         1       1  female  19.0     child
888         0       3  female   NaN     child
889         1       1    male  26.0      male
890         0       3    male  32.0      male

In [ ]:
titanic['child'] = titanic.apply(
    lambda r: 'child' if r.age < 20, axis = 1
)
titanic.tail()

#연습 문제 4.4.5

타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

In [24]:
# titanic['age'] = titanic.age.fillna(np.round(titanic.age.mean()))
titanic.age.fillna(np.round(titanic.age.mean()), inplace=True)
titanic.tail()

     survived  pclass     sex   age category1
886         0       2    male  27.0      male
887         1       1  female  19.0     child
888         0       3  female  30.0     child
889         1       1    male  26.0      male
890         0       3    male  32.0      male

# 연습문제 4.4.6
타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.

성별을 나타내는 문자열 male 또는 female로 시작한다.

성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.

예를 들어 27살 남성은 male27 값이 된다.

In [26]:
titanic['category2']=titanic.sex + titanic.age.astype(int).astype(str)
titanic.tail()

     survived  pclass     sex   age category1 category2
886         0       2    male  27.0      male    male27
887         1       1  female  19.0     child  female19
888         0       3  female  30.0     child  female30
889         1       1    male  26.0      male    male26
890         0       3    male  32.0      male    male32